<template>
  <div class="privacy-agreement">
    <p class="center"><strong>СОГЛАШЕНИЕ О КОНФИДЕНЦИАЛЬНОСТИ</strong></p>
    <div class="info">
      <div>По настоящему Соглашению Пользователь соглашается соблюдать условия конфиденциальности полученной от Общества с ограниченной ответственностью &laquo;Кубик-Медиа&raquo; информации, а ООО &laquo;Кубик-Медиа&raquo; обязуется соблюдать режим охраны персональных данных Пользователя.</div>
      <div>Пользователем является физическое лицо, обладающее в полном объеме дееспособностью, заинтересованное в получении доступа к Программе для ЭВМ Cubic Vision.</div>
      <div>ООО &laquo;Кубик-Медиа&raquo; является российским юридическим лицом, расположено по адресу: 109052, РФ, г. Москва, ул. Смирновская д.25, стр.1, ИНН 7722809844, ОГРН 1137746464932, являющееся правообладателем программы для ЭВМ Cubic Vision, доступ к которой получает Пользователь по настоящему Соглашению.</div>
      <div>Пользователь передает информацию ООО &laquo;Кубик-Медиа&raquo; для осуществления обратной связи с ним: форму обращения (никнэйм или имя) и адрес электронной почты. На данную информацию распространяется действие законодательства о защите персональных данных, и они хранятся ООО&nbsp;&laquo;Кубик-Медиа&raquo; только в целях предоставления Пользователю возможности доступа к сервису Cubic Vision, как данных, служащих для распознавания (идентификации) Пользователя.</div>
      <div>Программа для ЭВМ Cubic Vision не является поисковым сервисом и данные иных пользователей не доступны для Пользователя. Cubic Vision не подключен к социальным сетям, их возможностям, контактам.</div>
      <div>Обладая технической возможностью сделать снимок экрана, данное действие разрешается осуществлять только в целях дальнейшего использования Программы для ЭВМ Cubic Vision (напоминания, архивирование, отчетные документы для бухгалтерских целей для подтверждения использования и подобное) с необходимостью последующего удаления при прекращении действия настоящего Соглашения. Случаи публикации снимков экрана рассматриваются как доведение до всеобщего сведения, воспроизведение и иные способы использования без разрешения ООО&nbsp;&laquo;Кубик-Медиа&raquo; результатов интеллектуальной деятельности - дизайн программы, товарные знаки и иные объекты. При этом ООО&nbsp;&laquo;Кубик-Медиа&raquo; изменяет функции Программы в целях совершенствования предоставляемого сервиса и расширения возможностей на основании отслеживания манипуляций, переходов и используемого Пользователем контента.</div>
      <div>Пользователь не вправе заключать настоящее Соглашение, если его целью является изучение рынка услуг, на котором действует ООО&nbsp;&laquo;Кубик-Медиа&raquo;, изучение устройства сервиса в целях, отличных от потребительских.</div>
      <div>Настоящее Соглашение действует бессрочно в части сохранения режима конфиденциальности полученной информации. Обязательства ООО &laquo;Кубик-Медиа&raquo; предоставлять доступ в Личный кабинет прекращаются после истечения 3 месяцев. Для восстановления доступа после истечения трех месяцев, необходимо обратиться в службу поддержки ООО&nbsp;&laquo;Кубик-Медиа&raquo; по адресу электронной почты <a href="mailto:support@vision.cubicservice.ru">support@vision.cubicservice.ru</a>, повторная регистрация не предусмотрена.</div><br>
      <div v-if="isNext">Настоящее Соглашение считается заключенным после нажатия клавиши &laquo;Принимаю Соглашение&raquo;.</div>
    </div>
    <div v-if="isNext" class="row buttons">
      <div class="col prev-btn">
        <button class="btn btn-info" @click="prevClick">Назад</button>
      </div>
      <div class="col next-btn">
        <button class="btn btn-info" @click="nextClick">Принимаю соглашение</button>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'user-agreement',
  props: ['isNext'],
  methods: {
    nextClick () {
      this.$emit('onNext')
    },
    prevClick () {
      this.$emit('onPrev')
    }
  }
}
</script>

<style scoped>
  strong {
    font-weight: 900;
  }
  .center {
    text-align: center;
    font-size: 1.2em;
  }
  .info {
    margin-bottom: 10px;
    padding-inline-start: 40px;
  }
  .first {
    padding-inline-start: 30px;
    text-indent: 20px;
  }
  .buttons {
    margin-right: 20px;
    margin-left: 20px;
    padding-bottom: 10px;
  }
  .next-btn {
    text-align: right;
  }
</style>
