<template>
  <div class="user-agreement">
    <p class="center"><strong>ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ</strong></p>
    <p class="first"><strong>Общество с ограниченной ответственностью &laquo;Кубик-Медиа&raquo;</strong> в лице генерального директора Попова Александра Анатольевича, (далее Кубик-Медиа):</p>
    <ol>
      <li>Предоставляет Пользователю доступ к функциональным возможностям <strong>Программы для ЭВМ Cubic Vision</strong> (далее Cubic Vision) с целью его использования в соответствии с его функциональным назначением (управление видео контентом).</li>
      <li>Предоставляет Пользователю неисключительное право на однократное воспроизведение на его устройстве доступа к Cubic Vision.</li>
      <li>Предоставляет право хранить на своем сервере медиа-материалы Пользователя, делать резервные копии и совершать иные манипуляции с целью его использования в соответствии с его функциональным назначением (управление видео контентом).</li>
      <li>Пользователь заранее ознакомился с интерфейсом, функциональными возможностями CubicVision.</li>
      <li>Cubic Vision предоставляется &ldquo;как есть&rdquo;, то есть Пользователь приобретает право использования Cubic Vision со всеми функциональными возможностями и недостатками.</li>
      <li>За интернет-трафик Пользователя Кубик-Медиа ответственности не несет.</li>
      <li>Логин и пароль от Личного кабинета Пользователя являются персональной информацией, Пользователь самостоятельно несет ответственность и риски, связанные с созданием условий для возможного доступа третьих лиц к этим данным. Все действия и манипуляции, осуществляемые Пользователем в Личном кабинете, считаются совершенными от его имени.</li>
      <li>Права, не указанные в настоящем Договоре, считаются не предоставленными и Пользователю запрещается использовать любыми иными способами Cubic Vision не зависимо от того, осуществляется ли такое использование с целью извлечения прибыли или нет.</li>
      <li>Во всем остальном, что не предусмотрено настоящим Соглашением, Стороны руководствуются положениями законодательства Российской Федерации.</li>
      <li>Реквизиты ООО &ldquo;Кубик-Медиа&rdquo;</li>
    </ol>
    <div class="info">
      <span>ИНН 7722809844</span><br>
      <span>КПП 772201001</span><br>
      <span>Юридический адрес: 109052, РФ, г. Москва, ул. Смирновская д.25, стр.1</span><br>
      <span>Адрес для корреспонденции: 123308, г. Москва, пр-т Маршала Жукова, д. 2, к. 2, стр. 1</span><br>
      <span>e-mail: <a href="mailto:info@cubicmedia.ru">info@cubicmedia.ru</a></span><br>
      <span>Банковские реквизиты:</span><br>
      <span>Расчетный счет № 40702810301400003440</span><br>
      <span>в АО &laquo;Альфа-Банк&raquo; г. Москва</span><br>
      <span>К/с 30101810200000000593</span><br>
      <span>БИК 044525593</span><br>
    </div>
    <div v-if="isNext" class="row buttons">
      <div class="col prev-btn">
        <button class="btn btn-info" @click="prevClick">Назад</button>
      </div>
      <div class="col next-btn">
        <button class="btn btn-info" @click="nextClick">Принимаю Соглашение</button>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'user-agreement',
  props: ['isNext'],
  methods: {
    nextClick () {
      this.$emit('onNext')
    },
    prevClick () {
      this.$emit('onPrev')
    }
  }
}
</script>

<style scoped>
  strong {
    font-weight: 900;
  }
  .center {
    text-align: center;
    font-size: 1.2em;
  }
  .info {
    margin-bottom: 10px;
    padding-inline-start: 40px;
  }
  .first {
    padding-inline-start: 30px;
    text-indent: 20px;
  }
  .buttons {
    margin-right: 20px;
    margin-left: 20px;
    padding-bottom: 10px;
  }
  .next-btn {
    text-align: right;
  }
</style>


